"""
python的数据类型强制转换:
    set() 其他数据类型转集合类型
    1. 数字类型是非容器类型, 不能转换为集合
    2. 字符串转集合时,结果是无序的
    3. 列表转集合时,结果是无序的
    4. 字典转集合时,结果是无序的
    5. 字典转集合时,只保留字典中的键,结果是无序的
"""
# a = 123
# print(set(a)) #会报错 因为不可行

b = "abc123我爱你" ##{'我', 'a', '2', '爱', '1', '你', 'b', 'c', '3'}
print(set(b))

c = [1, 2, 3, "我", "a"] #{1, 2, 3, 'a', '我'}
print(set(c))

d = (1, 2, '我爱你', 6, 'abc') #{'abc', 1, 2, 6, '我爱你'}
print(set(d))

e = {
    "名字": "美女",
    "年龄": 18,
    0 : 1,
    5 : 8
} #{0, '年龄', 5, '名字'}
print(set(e))
