"""
集合:
    集合是无序的, 集合中的元素是唯一的, 集合一般用于元组或者列表中的元素去重,
    集合中默认去重
    创建集合
        1. 变量名 =  set(元组) 字符串/列表/元组/字典
        2. 变量名 = {元素, 元素, , , } 元组/字符串/数字
        3. 元素是唯一的, 用于列表的去重

    !! 字典/列表 不可放到集合里
"""
#字符串
a = set("1234")
print(a)         #{'2', '1', '3', '4'}

#列表
b = set([10, 20, 30,])
print(b)        #{10, 20, 30}

#元组
c = set((1, 2, 3, 4))
print(c)        #{1, 2, 3, 4}

#字典
d = {
    "年龄": 18,
    "名字": "美女"
}
f = set(d)
print(f)        #{'年龄', '名字'}

#用大括号创建集合
aa = {1, 2, 3, (1, 2, 3), "123", }
print(aa) #{1, 2, 3, (1, 2, 3), '123'}

#列表去重
a = set([1, 2, 1, 1, 1, 1, 1])
print(a) #{1, 2}

#元组去重
bb = set((1, 1, 1, 1))
print(bb) #{1}

#字典去重
cc = {
    "名字":"美女",
    "名字":"小明"
      }
ff = set(cc)
print(ff)

#字符串去重
zz = set('121122112')
print(zz)

